In [1]:
import numpy as np
import pandas as pd

frame=pd.DataFrame(np.random.randn(4,3),
            columns = ['a','b','c'],
            index=['台北','台中','台南','高雄'])
frame

           a         b         c
台北  0.631116  2.710768  0.448234
台中  0.404246 -0.668761 -0.816792
台南  0.507496 -2.914010  0.780019
高雄 -0.336037 -0.057770  0.138129

In [2]:
frame.dtypes

a    float64
b    float64
c    float64
dtype: object

In [3]:
frame['a']

台北    0.631116
台中    0.404246
台南    0.507496
高雄   -0.336037
Name: a, dtype: float64

In [4]:
def fm(x):    
    return 0

frame['a'] = frame['a'].map(fm)

In [5]:
def fm1(x):
    return 1
frame['b'] = frame['b'].map(fm1)

In [6]:
frame

    a  b         c
台北  0  1  0.448234
台中  0  1 -0.816792
台南  0  1  0.780019
高雄  0  1  0.138129

In [7]:
def fm2(x):
    return '{:.2f}'.format(x)
frame['c'] = frame['c'].map(fm2)
frame

    a  b      c
台北  0  1   0.45
台中  0  1  -0.82
台南  0  1   0.78
高雄  0  1   0.14

In [8]:
frame.dtypes

a     int64
b     int64
c    object
dtype: object

In [10]:
frame=pd.DataFrame(np.random.randn(4,3),
            columns = ['a','b','c'],
            index=['台北','台中','台南','高雄'])
frame

           a         b         c
台北 -0.948427  1.321256 -0.281076
台中 -0.425616  1.453561  0.854713
台南 -1.952176 -0.243304 -1.271983
高雄  0.051635  1.590222  1.803115

In [13]:
def fm3(x):
    return '{:.2f}'.format(x) 
frame=frame.applymap(fm3)

In [14]:
frame

        a      b      c
台北  -0.95   1.32  -0.28
台中  -0.43   1.45   0.85
台南  -1.95  -0.24  -1.27
高雄   0.05   1.59   1.80

In [15]:
frame=pd.DataFrame(np.random.randn(4,3),
            columns = ['a','b','c'],
            index=['台北','台中','台南','高雄'])
frame

           a         b         c
台北  1.647760  0.196883 -0.225950
台中 -0.523297 -0.116653 -1.529988
台南 -0.520025 -1.292210 -0.281194
高雄 -3.007610  0.244798  0.308107

In [17]:
def max1(x):
    return x.max() - x.min()
frame.apply(max1)

a    4.655370
b    1.537008
c    1.838096
dtype: float64

In [20]:
def max_min(x):
    return pd.Series([x.max(),x.min()], index=['max','min'])

frame.apply(max_min)

           a         b         c
max  1.64776  0.244798  0.308107
min -3.00761 -1.292210 -1.529988